{"intents": [
    {
        "tag": "greetings",
        "patterns": [
            "hello",
            "hallo",
            "Hallo",
            "yo",
            "yo, what's up",
            "hey",
            "hi",
            "hiya",
            "good day",
            "greetings",
            "what's up?",
            "how's it going?",
            "Hello po",
            "Hey po",
            "Hi po"
        ],
        "responses": [
            "Hello!",
            "Hey!",
            "What can I do for you?",
            "Yes, what can I help you with?"

        ]
    },
    {
        "tag": "goodbye",
        "patterns": [
            "see ya!",
            "goodbye",
            "see ya later!",
            "i'm going to go",
            "i'm gonna go",
            "i have to go",
            "Paalam po",
            "Thank you. Bye!",
            "Bye!"
        ],
        "responses": [
            "Awww, okay, take care!",
            "Okay, thanks for talking with me!",
            "Okay, goodbye!",
            "Understood. Goodbye!"
        ]
    },
    {
        "tag": "freshman_undergrad",
        "patterns": [
            "I'm interested in Freshman Undergraduate. What do I need for admission?",
            "Freshman",
            "freshman",
            "admission requirements for Freshman undergraduate",
            "admission requirements for freshman undergrad",
            "I plan on enrolling to CEU Makati as a Freshman, what do I need?",
            "What are the requirements that I need to enroll as a Freshman for CEU Makati?",
            "What are the admission requirements for Freshman Undergraduate?"
        ],
        "responses": [

            "For First Year Undegraduates, you will need: \n Original Form 138 or Grade 12 Report Card \n Certificate of Good Moral Character from high school principal \n 2x2 ID-type picture \n If you need additional information, visit our admission offices at CEU Makati Gil Puyat or Legazpi Village. Alternatively, you may visit or inquire at: \n Undergraduate Programs: <a href='https://www.ceu.edu.ph/admission-subpages/16' target='_blank'>https://www.ceu.edu.ph/admission-subpages/16 color: white'>Admission Freshman</a> \n Graduate Programs: <a href='https://www.ceu.edu.ph/admission-subpages/22' target='_blank'>https://www.ceu.edu.ph/admission-subpages/22</a> \n Email: <a href='mailto:ceumakatiadmission@ceu.edu.ph'>ceumakatiadmission@ceu.edu.ph</a>, <a href='mailto:mktenroll@ceu.edu.ph'>mktenroll@ceu.edu.ph</a> or <a href='mailto:ceumakati_helpdesk@ceu.edu.ph'>ceumakati_helpdesk@ceu.edu.ph</a> \n Contact: 09634681399."
        ]
    },
    {
        "tag": "transfer_student_undergrad",
        "patterns": [
            "Are there any specific admission requirements for transfer students?",
            "What are the admission requirements for transfer students?",
            "I'm interested in the undergraduate program but I'm a transferee. What do I need for admission?",
            "transferee",
            "Transferee",
            "Transferee student",
            "transfer student",
            "I plan on enrolling to CEU Makati as a transferee, what do I need?",
            "What are the requirements that I need to enroll as a transferee for CEU Makati?"
        ],
        "responses": [
           "For Transferee Students, you will need \n Scholastic Records signed by the Registrar \n Transfer Credentials \n Certificate of Good Moral Character from Authorized Official of former school \n Certified True Copy of Birth Certificate \n Student and Parents/Guardians letter of intent seeking admission \n Drug Test result \n 2x2 ID-type picture."
        ]
    },
    {
        "tag": "admission_application_process",
        "patterns": [
            "How can I apply for admission to the university?",
            "How do I apply for admission?",
            "Application process for admission",
            "What's the process for applying to the university?",
            "I want to apply to the university. How do I start?",
            "Can you guide me through the admission application?",
            "Admission application process",
            "Let me apply to the university. How do I start?",
            "I want to apply my son/daugther, can you help me with that?",
            "I'm interested in applying to the university. How?"
        ],
        "responses": [
            "You can easily apply online through our official website or visit our admissions office either at Gil Puyat or Legazpi Village campus. Here is the link of the website: <a href='https://admission2.ceu.edu.ph/student-applicant-information' target='_blank' style='text-decoration: underline; color: white'>CEU Admission Application Process</a>",
            "You may apply through our official website or contact our admissions office at Gil Puyat or Legazpi Village for further assistance. Here is the link of the website: <a href='https://admission2.ceu.edu.ph/student-applicant-information' target='_blank' style='text-decoration: underline; color: white'>CEU Admission Application Process</a>"
        ]
    },
    {
        "tag": "admission_fee",
        "patterns": [
            "admission fee",
            "admission fee cost",
            "What is the admission fee for Centro Escolar University Makati?",
            "Admission fee for Centro Escolar University Makati",
            "Can you tell me about the admission fee for Centro Escolar University Makati?",
            "What is the admission fee for Centro Escolar University Makati?",
            "I'm interested in Centro Escolar University Makati. What is the admission fee?",
            "I want to know about the admission fee for Centro Escolar University Makati",
            "Give me admission fee for Centro Escolar University Makati",
            "May I know the admission fee for applying in CEU Makati?"
        ],
        "responses": [
            "The admission fee varies depending on the program. Details regarding the admission fee will be provided to you after your admission via email."
        ]  
    },
    {
        "tag": "school_schedule",
        "patterns": [
            "school schedule",
            "What is the school schedule for Centro Escolar University Makati?",
            "School schedule for Centro Escolar University Makati",
            "Can you tell me about the school schedule for CEU Makati?",
            "What is the school schedule for CEU Makati?",
            "I'm interested in CEU Makati. What is the school schedule?",
            "I want to know about the school schedule for CEU Makati",
            "Give me school schedule for CEU Makati",
            "May I know the school schedule for applying in CEU Makati?"
        ],
        "responses": [
            "The school schedule depends on the program. You can find detailed information on our official website or contact our admissions office for personalized assistance."   
        ]
    },
    {
        "tag": "course_schedule",
        "patterns": [
            "course schedule",
            "Can I customize my course schedule based on my preference?",
            "I want to customize my course schedule based on my preference, tell me how",
            "Can I customize my course schedule based on my preferences?",
            "Help me customize my course schedule"
        ],
        "responses": [
            "Only irregular students are allowed to customize their schedules since regular students are already grouped into sections. To view your schedule, visit <a href='https://caresmkt.ceu.edu.ph/serp/Gate/Login.aspx' target='_blank' style='text-decoration: underline; color: white'>this link</a>. Your login credentials will be sent to your email once enrolled."
        ]
    },
    {
        "tag": "meeting_schedule",
        "patterns": [
            "Can I schedule a meeting with an admission counselor for personlized assistance?",
            "I want to schedule a meeting with an admission counselor for personalized assistance",
            "Help me schedule a meeting with an admission counselor for personalized assistance",
            "schedule meeting with admission counselor for more help"
        ],
        "responses": [
            "Yes, you can schedule a meeting with an admission counselor. You may go through the <a href='https://www.ceu.edu.ph/admission-subpages/16' target='_blank' style='text-decoration: underline; color: white'>official CEU Makati website</a> to find our admission office contacts or send us a message through our <a href='https://www.facebook.com/CEUMakati05' target='_blank' style='text-decoration: underline; color: white'>official FB page</a>." ,
            "If you want to schedule a meeting with an admission counselor, you can go through the <a href='https://www.ceu.edu.ph/admission-subpages/16' target='_blank' style='text-decoration: underline; color: white'>official CEU Makati website</a> to find our admission office contacts or send us a message through our <a href='https://www.facebook.com/CEUMakati05' target='_blank' style='text-decoration: underline; color: white'>official FB page</a>."
        ]  
    },
    {
        "tag": "school_events",
        "patterns": [
             "Events",
            "events",
            "school events",
            "What is the school events for Centers Escolar University Makati?",
            "School events for Centers Escolar University Makati",
            "Can you tell me about the school events for Centers Escolar University Makati?",
            "What is the school events for Centers Escolar University Makati?",
            "I'm interested in Centers Escolar University Makati. What are the school events?",
            "I want to know about the school events for Centers Escolar University Makati",
            "Give me school events for Centers Escolar University Makati",
            "May I know the school events for applying in CEU Makati?"
        ],
        "responses": [
            "The school events depends on the program. You can find detailed information on our official website or contact our admissions office for personalized assistance.",
            "Here is the official [school year] events for CEU Makati. Follow our <a href='https://www.facebook.com/CEUMakati05' target='_blank' style='text-decoration: underline; color: white'>official FB page</a> to stay updated with the latest events.",
            "School events may vary on the program you are in. You can find detailed information on our <a href='https://www.ceu.edu.ph/admission-subpages/16' target='_blank' style='text-decoration: underline; color: white'>official website</a> or contact our admissions office for personalized assistance."
            ]        
    },

    {
        "tag": "school_faculty",
        "patterns": [
            "Faculty",
            "faculty",
            "school faculty",
            "Who are the school faculty for Centers Escolar University Makati?",
            "School faculty for Centers Escolar University Makati",
            "Can you tell me about the school faculty for Centers Escolar University Makati?",
            "What is the school faculty for Centers Escolar University Makati?",
            "I'm interested in Centers Escolar University Makati. What is the school faculty?",
            "I want to know about the school faculty for Centers Escolar University Makati",
            "Give me school faculty for Centers Escolar University Makati",
            "May I know the school faculty in CEU Makati?"
        ],
        "responses": [
            "Meet our esteemed school faculty members: "
        ]
        
    },

    {
        "tag": "about_uss",
        "patterns": [
            "about us",
            "about us CEU Makati",
            "About Us",
            "About us"
        ],
        "responses": [
            "Two years before CEU's centennial celebration, on March 22, 2005, the community witneeded the birt of CEU Makati, Gil Puyat Campus. \n The academic offerings included degree programs that responsded to the global market particularly Hote and Restaurant Management, Tourism Management, Information Technology, Computer Science, Business Administriation, Mass Communication major in Broadcasting, Master of Business Administration, and first-class health science programs for which CEU has always been known for such as Doctor of Dental Medicine, Medical Technology, Nursing, Pharmacy, Doctor of Pharmacy, and Psychology. \nDr. Maria Cristina D. Padolina, the 7th CEU President, spearheaded the opening of the second campus of Centro Escolar Universit Makati-Legazpi in 2007 and the School of Law and Jurisprudence in 2009."
        ]
        
    },

    {
        "tag": "entrance_exams",
        "patterns": [
            "Are there any entrance exams for admission?",
            "Do I need to take an entrance exam for admission?",
            "Entrance exams for admission",
            "What about entrance exams?",
            "Are entrance exams required for admission?",
            "Do I have to pass an entrance exam?",
            "I'm worried about entrance exams. Are there any?",
            "I'm interested in admission. Do I need an entrance exam?"
        ],
        "responses": [
            "Yes, Centro Escolar University Makati conducts entrance exams for admission. You can find details about the exam schedule, format, and preparation tips on our admissions page. If you have specific questions, feel free to reach out to our admissions office for assistance.",
            "Yes, there are entrance exams for admission. To learn more about the exam schedule, format, and preparation tips, please visit our admissions page so you may be able to make an informed decision and prepare for the entrance exam. Don't worry, you got this!"
        ]
    },
    {
        "tag": "admission_deadline",
        "patterns": [
            "What is the admission deadline for the upcoming semester?",
            "When is the deadline to apply for the next semester?",
            "Admission deadline for upcoming semester",
            "When do I need to apply for the next semester?",
            "Deadline for admission for next semester",
            "When are applications due for the upcoming semester?",
            "Is there a deadline for admission? If so, when and where?",
            "I'm interested in admission. What's the deadline for the upcoming semester?"
        ],
        "responses": [
            "Admission deadlines can vary by program and semester. To ensure you have the most accurate information, please visit our official website or contact our admissions office directly. They will provide you with details about application deadlines for the upcoming semester.",
            "The admission deadlines can differ from the program you want to enroll in and the semester you are applying for. If you need additional information, you may visit our admission offices Gil Puyat or Legazpi Village campus or check our website  <a href='https://www.ceu.edu.ph/admission-subpages/15/' target='_blank' style='text-decoration: underline; color: white'>here</a>."
        ]
    },

    {
        "tag": "programs_information",
        "patterns": [
            "Can you provide information about the different programs available for admission?",
            "What programs are available for admission?",
            "Tell me about the programs I can apply for",
            "Available programs for admission",
            "List of programs for admission",
            "Programs offered for admission",
            "I want to know about the programs available for admission",
            "I'm interested in admission. What are the programs?",
            "My son is interested in admission. What do I need to know about?",
            "My daughter wants to apply to the university. What do I need to know about?",
            "I'm interested in admission. What programs are available?"
        ],
        "responses": [
            "Certainly! Centro Escolar University Makati offers a wide range of programs across various disciplines. You can explore the full list of programs on our <a href='https://www.ceu.edu.ph/admission-subpages/15/' target='_blank' style='text-decoration: underline; color: white'>official website</a> or contact our admissions office for personalized assistance.",
            "Yes, there are various programs available for admission. You can explore the full list of programs on our <a href='https://www.ceu.edu.ph/admission-subpages/15/' target='_blank' style='text-decoration: underline; color: white'>official website</a>.",
            "Yes, we offer a diverse range of programs. To find out more about the full list of programs, go to our <a href='https://www.ceu.edu.ph/admission-subpages/15/' target='_blank' style='text-decoration: underline; color: white'>official website</a> or contact our admissions office for personalized assistance."
            
        ]
    },
    {
        "tag": "tuition_fees",
        "patterns": [
            "What are the tuition fees for ",
            "Can you tell me about the tuition fees for ",
            "How much do the courses cost in terms of tuition?",
            "Tuition fees for different ",
            "Cost of  in terms of tuition fees",
            "What are the fees for different programs?"
        ],
        "responses": [
            "Tuition fees can vary based on the program and other factors. For detailed information about the tuition fees for specific courses, please visit our official website or contact our finance office. They can provide you with a breakdown of tuition costs and any available financial aid or scholarship options."
            
        ]
    },
    {
        "tag": "financial_aid_scholarship",
        "patterns": [
            "Can you provide information about financial aid and scholarship options available for incoming students?",
            "What financial aid and scholarship options are available?",
            "Tell me about financial aid and scholarships for incoming students",
            "Financial assistance and scholarship details",
            "What are the financial aid and scholarship opportunities for new students?",
            "Scholarship options for incoming students",
            "I'm interested in financial aid and scholarship. Tell me more about it"

        ],
        "responses": [
            "Certainly! We offer various financial aid and scholarship opportunities. Various scholarship programs are available to qualified students. You may visit the link for more info. <a href='https://www.ceu.edu.ph/admission-subpages/20#tab-38' target='_blank' style='text-decoration: underline; color: white'>Click here</a>"
        ]
    },
    {
        "tag": "admission_documents_submission",
        "patterns": [
            "What documents are required for the admission process, and how can I submit them?",
            "Documents required for admission and submission process",
            "How do I submit required documents for admission?",
            "Submission process for admission documents",
            "Required documents and submission details",
            "What documents do I need to submit for admission?"
        ],
        "responses": [
            "The required documents for admission may vary by program. You can find a comprehensive list on our official website under the admissions section. The submission process details, including online portals or physical submission locations, will also be provided there. For further assistance, you can contact our admissions office at 259 Sen. Gil Puyat Avenue, Makati City, 1203, or reach them at (02) 8889-8169, (02) 8889-7493, or (02) 8843-0300. You can also email ceumakatiadmission@ceu.edu.ph."
        ]
    },

    {
        "tag": "course_change",
        "patterns": [
            "program change",
            "Can I change my course?",
            "Can I shift to a different course or program",
            "I want to shift to a different program",
            "Can I change my  to another program?",
            "Can I transfer my course to another program?",
            "Give me information on how to change my ",
            "I plan on shifting to another . How?"
        ],
        "responses": [
            "Yes, it is possible to change your course. You can visit our website for more information. You can also reach out to our admissions office for assistance. \n <a href='https://www.ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>Click here</a> to visit our website."
        ]
    },

    
    {
        "tag": "acceptance_rate",
        "patterns": [
            "What is the acceptance rate for Centro Escolar University Makati?",
            "Acceptance rate for CEU Makati",
            "How difficult is it to get into CEU Makati?",
            "What are the chances of acceptance at CEU Makati?",
            "Is there a high acceptance rate at CEU Makati?",
            "What percentage of applicants get accepted to CEU Makati?"
        ],
        "responses": [
            "The acceptance rate can vary based on various factors, including the program and the number of applicants. For the most accurate and up-to-date information on acceptance rates, please reach out to our admissions office. They can provide insights into the acceptance trends for your specific program of interest. Contact them at 259 Sen. Gil Puyat Avenue, Makati City, 1203, or by phone at (02) 8889-8169, (02) 8889-7493, or (02) 8843-0300, or via email at ceumakatiadmission@ceu.edu.ph."
        ]
    },
    {
      "tag": "curriculum_inquiry",
      "patterns": [
          "Can you provide details about the curriculum for [specific course]?",
          "Tell me more about the courses offered at Centro Escolar University Makati.",
          "Courses offered at CEU Makati",
          "What courses does CEU Makati offer?",
          "Can you provide information about the courses at CEU Makati?",
          "List of courses at Centro Escolar University Makati",
          "What are the available programs at CEU Makati?",
          "I want to know about the curriculum for [specific course]",
          "Give me this courses offered at Centers Escolar University Makati",
          "I want curriculum for this course"
      ],
      "responses": [
          "We offer a diverse range of courses across different disciplines. You can explore our course catalog on the website or connect with our academic advisors for personalized guidance based on your interests.\n\nAbbreviations:\n- Accountancy and Management Department (AMD)\n- Computer Science and Information Technology Department (CSIT)\n- Dentistry Department (DD)\n- Hospitality Management Department (HM)\n- Medical Technology Department (MT)\n- Nursing Department (ND)\n- Pharmacy Department (PD)\n- Psychology Department (PSD)\n- Tourism Management Department (TM)\n\nPlease type which department you would like to see the courses available and know the details about it."
      ]
  },
  {
      "tag": "accountancy_management_department",
      "patterns": [
          "Accountancy and Management Department",
          "Accountancy and Management",
          "What are offered in the Accountancy and Management Department?",
          " in the Accountancy and Management Department",
          "Accounting ",
          "Management",
          "Accountancy and Management",
          "AMD",
          "amd",
          "I would like to know about AMD",
          "Give me information about Accountancy and Management Department",
          "What do you have in AMD?"
      ],
      "responses": [
          "Here are the courses available in the Accountancy and Management Department:\n1. BSA - Bachelor of Science in Accountancy (4 years and 2 summer terms)\n2. BSLM - Bachelor of Science in Legal Management (3 years and 2 summer terms)\n3. BSBAIM - Bachelor of Science in Business Administration major in International Management\n\nPlease type the corresponding abbreviation for more information.",
          "There are many courses offered in the Accountancy and Management Department. 1. BSA - Bachelor of Science in Accountancy (4 years and 2 summer terms)\n2. BSLM - Bachelor of Science in Legal Management (3 years and 2 summer terms)\n3. BSBAIM - Bachelor of Science in Business Administration major in International Management\n Please type the abbreviation of the department you would like to know more about."
      ]
  },
  {
      "tag": "course_selection_BSA",
      "patterns": [
          "BSA",
          "BSA - Bachelor of Science in Accountancy",
          "Bachelor of Science in Accountancy",
          "What are the courses available for BSA?",
          "Bachelor of Science in Accountancy",
          "What are offered in the Bachelor of Science in Accountancy?",
          "BS of Accountancy"
      ],
      "responses": [
          "PROGRAM OUTCOMES OF BSA\nThe graduates of Bachelor of Science in Accountancy should be able to:\n- Resolve business issues and problems with a global and strategic perspective using knowledge and technical proficiency in areas of financial accounting and reporting, cost accounting, management accounting and control, taxation, and accounting information systems;\n- Conduct accountancy research through independent studies with relevant literature and appropriate use of accounting theory and methodologies;\n- Employ technology as a business tool in capturing financial and non-financial information, generating reports and making decisions;\n- Apply knowledge and skills to successfully respond to various types of assessments (including professional licensure examinations); and\n- Confidently maintain a commitment to good corporate citizenship, social responsibility, and ethical practice in performing functions as an accountant.\n\nEMPLOYMENT OPPORTUNITIES FOR BSA\nAccounting/Finance Educator\nBookkeeper\nBusiness Analyst\nChief Accountant\nConsultant/Advisor\nComptroller\nCost Accountant\nExternal Auditor\nFinancial Analyst\nInternal Auditor\nStaff Accountant\nTax Specialist"
      ]
  },
  {
    "tag": "course_selection_BSLM",
    "patterns": [
        "BSLM",
        "BSLM - Bachelor of Science in Legal Management",
        "Bachelor of Science in Legal Management",
        "What are the courses available for BSLM?",
        "What are offered in the Bachelor of Science in Legal Management?",
        "BS in Legal Management"
    ],
    "responses": [
        "The program cultivates expertise in the latest field developments, bilingual communication, legal and management application, critical problem-solving, ethical decision-making, and strategic partnership, ensuring graduates are adept, ethical, and globally competitive professionals.\n\nEMPLOYMENT OPPORTUNITIES FOR BSLM\nInventory Control Analyst\nProduction Supervisor/Manager\nBank manager\nProcess/Continuous Improvement Manager\nMarketing/Sales\nLogistics Planner\nDemand Planner\nPurchasing Specialist/Analyst\nSales and Operations Officer\nMarketing/Sales Officer\nEvents Manager\nFacilities Supervisor/Manager\nSupply Chain Analyst\nProject Specialist"
    ]
  }, 
  {
    "tag": "course_selection_BSBAIM",
    "patterns": [
        "BSBAIM",
        "BSBAIM - Bachelor of Science in Business Administration Major in International Management",
        "Bachelor of Science in Business Administration Major in International Management",
        "What are the courses available for BSBAIM?",
        "What are offered in the Bachelor of Science in Business Administration Major in International Management?",
        "BS in Business Administration Major in International Management"
    ],
    "responses": [
        "Graduates of the Bachelor of Science in Business Administration major in International Management excel in navigating the global arena. They employ creative strategies, assess market dynamics, and foster cross-cultural understanding. Proficient in identifying opportunities and mitigating risks, they make informed decisions, integrating political, economic, legal, and social considerations for sustainable success.\n\nEMPLOYMENT OPPORTUNITIES FOR BSBAIM\nInventory Control Analyst\nProduction Supervisor/Manager\nBank manager\nProcess/Continuous Improvement Manager\nMarketing/Sales\nLogistics Planner\nDemand Planner\nPurchasing Specialist/Analyst\nSales and Operations Officer\nMarketing/Sales Officer\nEvents Manager\nFacilities Supervisor/Manager\nSupply Chain Analyst\nProject Specialist"
    ]
  },
  {
      "tag": "computer_science_IT_department",
      "patterns": [
          "Computer Science and Information Technology Department",
          "Computer Science and IT",
          "Computer Science",
          "Information Technology",
          "What are offered in the Computer Science and Information Technology Department?",
          "in the Computer Science and IT Department",
          "CS",
          "IT",
          "CSIT",
          "CS & IT",
          "I would like to know about curriculum in CSIT",
          "What are available in CSIT?",
          "What do you have in CSIT?"
      ],
      "responses": [
          "Here is the information about the curriculum for courses offered by the Computer Science and Information Technology Department...",
          "Sure thing. These are the curriculum information for the Computer Science and Information Technology Department:\n1. BSIT - Bachelor of Science in Information Technology\n2. BSCS - Bachelor of Science in Computer Science"
      ]
  },
  {
    "tag": "course_selection_BSCS",
    "patterns": [
        "BSCS",
        "BSCS - Bachelor of Science in Computer Science", 
        "Bachelor of Science in Computer Science", 
        "What are the courses available for BSCS", 
        "What are offered in the Bachelor of Science in Accountancy", 
        "BS of Computer Science"
    ],
    "responses": [
        "The graduates of Bachelor of Science in Computer Science should be able to: \nTo apply fundamental computing knowledge to solve complex problems, analyze and research computing issues, design and evaluate solutions considering societal and ethical implications, collaborate effectively in diverse teams, communicate clearly about computing activities, adhere to legal and professional standards, cultivate independent learning, and lead in developing technical solutions for organizational needs including network configuration and migration to cloud-based systems.\nApplications Developer\nComputer Science Instructor\nDatabase Programmer / Designer\nInformation Security Engineer\nQuality Assurance Engineer\nResearcher\nSystems Developer\nSystems Analyst"
    ]
  }, 
  {
    "tag": "course_selection_BSIT",
    "patterns": [
        "BSIT",
        "BSIT - Bachelor of Science in Information Technology", 
        "Bachelor of Science in Information Technology", 
        "What are the courses available for BSIT", 
        "What are offered in the Bachelor of Science in Information Technology", 
        "BS of Information Technology"
    ],
    "responses": [
        "The graduates of Bachelor of Science in Information Technology should be able to: \nTo apply knowledge of computing, science, and mathematics, analyze complex problems, design and evaluate computer-based systems, integrate IT solutions effectively, collaborate in development teams, communicate clearly about computing activities, analyze the societal impact of information technology, adhere to professional and ethical standards, engage in self-learning and professional development, and apply principles of network design, implementation, maintenance, and security to protect information systems.\nApplications Developer\nDatabase Administrator\nEntrepreneur in the IT Industry\nInformation Security Administrator\nInformation Technology Instructor\nNetwork Administrator\nNetwork Engineer\nSystems Analyst\nTechnical Support Specialist\nTest Engineer\nWeb Administrator\nWeb MasterWeb Developer"
    ]
  },
  {
      "tag": "dentistry_department",
      "patterns": [
          "Dentistry Department",
          "Dentistry",
          "What  are offered in the Dentistry Department?",
          "DD",
          "DMD",
          "Dent",
          "Dentist",
          "What are available in Dentistry Department?",
          "What do you have in Dentistry?"
      ],
      "responses": [
          "Here are the courses available in the Dentistry Department:\n1. Doctor of Dental Medicine (DMD)\n2. Certificate in Dental Hygiene"
      ]
  },
  {
    "tag": "course_selection_DDM",
    "patterns": [
        "DDM",
        "DDM - Doctor of Dental Medicine", 
        "Doctor of Dental Medicine", 
        "What are the courses available for DDM", 
        "What are courses offered in Doctor of Dental Medicine"
    ],
    "responses": [
        "The graduates of the School of Dentistry program must be able to:\nTo proficiently relate normal human structure and functions to abnormal conditions, develop accurate diagnoses for appropriate treatment planning, integrate effective communication skills and systematic approaches to diagnosis for comprehensive oral health care across diverse populations, fortify research skills and contribute to treatment advancements, commit to lifelong learning to stay current in the field, apply business principles and innovative technology in dental practice, engage in community outreach programs to demonstrate social responsibility, and adhere to ethical and legal standards in dental practice.\nAcademe (Dental Faculty)\nBusinessman/Entrepreneur\nCompany Dentist\nDental Associate\nDental Laboratory Consultant\nDental Nurse\nDental Representative (Drug Company)\nDental Reviewer\nHospital Dentist\nIndustrial Dentist\nEtc..."
    ]
  },
  {
      "tag": "hospitality_management_department",
      "patterns": [
          "Hospitality Management Department",
          "Hospitality Management",
          "What  are offered in the Hospitality Management Department?",
          " in the Hospitality Management Department",
          "hospitality",
          "hotel",
          "restaurant",
          "HM",
          "hotel and restaurant management",
          "hotel and restaurant",
          "hotel restaurant management",
          "Tell me more about Hospital Management Department",
          "What are available in Hospitality Management Department?",
          "What do you have in Hospitality Management?"

      ],
      "responses": [
          "Here are the courses available in the Hospitality Management Department:\n1. Bachelor of Science in Hospitality Management\n2. Associate in Hotel and Restaurant Management",
          "Sure thing! These are the courses available in the Hospitality Management Department:\n1. Bachelor of Science in Hospitality Management\n2. Associate in Hotel and Restaurant Management"
      ]
  }, 
  {
    "tag": "course_selection_BSIHMHRCO",
    "patterns": [
        "BSIHM HRCO",
        "BSIHM HRCO - Bachelor of Science in International Hospitality Management with Specialization in Hotel, Restaurant and Culinary Operations", 
        "Bachelor of Science in International Hospitality Management with Specialization in Hotel, Restaurant and Culinary Operations", 
        "What are the courses available for BSIHM HRCO", 
        "What are the courses offered in Bachelor of Science in International Hospitality Management with Specialization in Hotel, Restaurant and Culinary Operations"
    ],
    "responses": [
        "The graduates of the BSIHM HRCO program must be able to:\nTo demonstrate effective communication, work collaboratively in diverse teams, employ problem-solving and critical thinking skills, uphold professional and ethical standards with excellent customer service, utilize information technology for tourism and hospitality purposes, produce food products and services according to industry standards, manage food and beverage operations effectively, deliver high-quality guest services at front office and housekeeping levels, ensure safety and security through risk management programs, and maintain compliance with industry and government regulations.\nCruise Manager\nCruise Director\nCabin Housekeeping Supervisor\nSales and Marketing Director\nMeeting and Events Manager\nBar Lounge Manager\nClub Manager\nProduction Manager\nFront Office Receptionist\nConcierge"
    ]
  },
  {
    "tag": "course_selection_BSIHMCIRO",
    "patterns": [
        "BSIHM CIRO",
        "BSIHM CIRO - Bachelor of Science in International Hospitality Management with Specialization in Cruise and Integrated Resort Operations", 
        "Bachelor of Science in International Hospitality Management with Specialization in Cruise and Integrated Resort Operations", 
        "What are the courses available for BSIHM CIRO", 
        "What are the courses offered in Bachelor of Science in International Hospitality Management with Specialization in Cruise and Integrated Resort Operations"
    ],
    "responses": [
        "The graduates of the BSIHM CIRO program must be able to:\nTo demonstrate effective communication, work collaboratively in diverse teams, employ problem-solving and critical thinking skills, uphold professional and ethical standards with excellent customer service, utilize information technology for tourism and hospitality purposes, produce food products and services according to industry standards, manage food and beverage operations effectively, deliver high-quality guest services at front office and housekeeping levels, ensure safety and security through risk management programs, and maintain compliance with industry and government regulations.\nCruise Manager\nCruise Director\nCabin Housekeeping Supervisor\nSales and Marketing Director\nMeeting and Events Manager\nBar Lounge Manager\nClub Manager\nProduction Manager\nFront Office Receptionist\nConcierge"
    ]
  },
  {
      "tag": "medical_technology_department",
      "patterns": [
          "Medical Technology Department",
          "Medical Technology",
          "What  are offered in the Medical Technology Department?",
          " in the Medical Technology Department",
          "Medtech",
          "MT",
          "Med Tech",
          "I would like to know about curriculum in Medtech",
          "I want to get into Medtech",
          "Tell me more about the courses of Medtech",
          "Give me Medtech courses",
          "What are available in Medical Technology Department?",
          "What do you have in Med tech?"
      ],
      "responses": [
          "Here are the courses available in the Medical Technology Department:\n1. Bachelor of Science in Medical Technology",
          "No problem! What you see are the courses available for Medical Technology Department: \n1. Bachelor of Science in Medical Technology"
      ]
  }, 
  {
    "tag": "course_selection_BSMT",
    "patterns": [
        "BSMT",
        "BSMT - Bachelor of Science in Medical Technology", 
        "Bachelor of Science in Medical Technology", 
        "What are the courses available for BSMT", 
        "What are the courses offered in Bachelor of Science in Medical Technology"
    ],
    "responses": [
        "Bachelor of Science in Medical Technology graduates possess a deep understanding of laboratory testing principles, excel in clinical tests while ensuring biosafety, integrate quality management, foster analytical thinking, conduct research, interpret health data, communicate effectively, demonstrate leadership and ethics, prioritize lifelong learning, and engage in community initiatives responsibly.\nAnalysts in clinical laboratories,drug testing laboratories,water analysis  laboratories, pharmaceutical companies,veterinary clinics,food companies,cosmetics clinics,fertility clinics,microbiological laboratories,and nuclear medicine laboratories\nResearchers in clinical/educational/diagnostic institutions\nProfessional Product Specialists in manufacturing/marketing/sales companies\nAcademicians and Health Science \nEducators\nMedical Transcriptionists\nForensic Technologists\nSpecialists in Laboratory Information Systems\nPerfusionists\nCardiographic Technologists\nPublic Health \nPractitioners"
    ]
  },
  {
      "tag": "nursing_department",
      "patterns": [
          "Nursing Department",
          "Nursing",
          "What  are offered in the Nursing Department?",
          " in the Nursing Department",
          "nurse",
          "ND",

          "I want to get into nursing. Show me nursing courses",
          "What are available in Nursing?",
          "What do you have in Nursing?"
      ],
      "responses": [
          "Here are the courses available in the Nursing Department:\n1. Bachelor of Science in Nursing\n2. Associate in Health Science Education (AHSE) leading to Bachelor of Science in Nursing"
      ]
  },
  {
    "tag": "course_selection_BSN",
    "patterns": [
        "BSN",
        "BSN - Bachelor of Science in Nursing", 
        "Bachelor of Science in Nursing", 
        "What are the courses available for BSN", 
        "What are the courses offered in Bachelor of Science in Nursing"
    ],
    "responses": [
        "Graduates of the nursing program exhibit comprehensive knowledge across physical, social, natural, and health sciences, applying holistic care through reflective thinking and evidence-based practice while adhering to legal and ethical standards. They excel in effective communication, reporting, and teamwork, demonstrating management and leadership in client care with accountability and stewardship. Committed to lifelong learning, they engage in research to enhance nursing practice, embodying professionalism, integrity, and Filipino values. They leverage technology for innovative healthcare delivery, integrate entrepreneurial skills, and prioritize sustainability, ensuring excellence in their profession.\nClinical Nursing\nCommunity Health Nursing\nPrivate Duty Nursing\nOccupational Health Nursing\nSchool Nursing\nMilitary Nursing\nHealth Education\nResearch\nEntrepreneurship"
    ]
  },
  {
      "tag": "pharmacy_department",
      "patterns": [
          "Pharmacy Department",
          "Pharmacy",
          "What are offered in the Pharmacy Department?",
          "in the Pharmacy Department",
          "What are available in Pharmacy Department?",
          "Pharmacy courses",
          "Pharma",
          "PD",
          "I want to get into Pharmacy. Show me Pharmacy courses",
          "What do you have in Pharmacy?"
      ],
      "responses": [
          "Here are the courses available in the Pharmacy Department:\n1. Bachelor of Science in Pharmacy\n2. Pharmacy Assistant Course"
      ]
  }, 
  {
    "tag": "course_selection_BSP",
    "patterns": [
        "BSP",
        "BSP - Bachelor of Science in Pharmacy", 
        "Bachelor of Science in Pharmacy", 
        "What are the courses available for BSP", 
        "What are the courses offered in Bachelor of Science in Pharmacy"
    ],
    "responses": [
        "The Pharmacy degree curriculum aims to equip graduates with scientific competence, technical skills, and a compassionate, responsible approach to pharmacy practice. Graduates will possess a thorough understanding of patient-centered care, effective communication, and collaboration, enabling them to deliver comprehensive pharmaceutical services across various settings. They will be adept at performing pharmacy duties, designing innovative care programs, conducting research, and upholding ethical and legal standards. Committed to lifelong learning, they will continuously enhance their knowledge and skills to meet evolving healthcare needs.\nDrug Store Owner/Manager\nSupervising Pharmacist\nHospital Pharmacist\nClinical Pharmacist\nPharmacist Owner/Manager/Supervisor/Staff\nRegulatory Pharmacist\nAdministrator\nDean\nFood and Drug Regulation Officer (FDRO)\nDrug Regulation Officer (DRO)\nHMO Pharmacist\nResearcher\nCompany Pharmacist"
    ]
  },
  {
      "tag": "psychology_department",
      "patterns": [
          "Psychology Department",
          "Psychology",
          "What  are offered in the Psychology Department?",
          " in the Psychology Department",
          "PsyD",
          "PSD",
          "I would like to know about curriculum in Psych",
          "I want to get into Psych. Show me Psych courses",
          "What are available in Psychology Department?",
          "Tell me more about Psychology Department",
          "What do you have in Psychology?"
      ],
      "responses": [
          "Here are the courses available in the Psychology Department:\n1. Bachelor of Science in Psychology\n2. Bachelor of Science in Psychology with specialization in Industrial-Organizational Psychology"
      ]
  }, 
  {
    "tag": "course_selection_Psychology",
    "patterns": [
        "Psychology",
        "Bachelor of Science in Psychology",  
        "What are the courses available for Psychology", 
        "What are the courses offered in Bachelor of Science in Psychology"
    ],
    "responses": [
        "The graduates of Bachelor of Science in Psychology should be able to:\nTo apply sound psychological theories and methods in personal, interpersonal, and professional contexts, contributing to the creation of new knowledge in diverse settings. They adhere to the highest ethical standards in research and service design, developing valid and reliable assessment tools for accurate evaluation and interpretation. Effective communication fosters meaningful relationships, while self-reflection and independent learning drive continuous personal and professional growth. Engaging in advocacy programs, they actively contribute to mental health and wellness initiatives, striving to enhance overall quality of life within communities.\nHuman Resource\nBusiness\nResearch\nTeaching\nSocial Services"
    ]
  },
  {
      "tag": "tourism_management_department",
      "patterns": [
          "Tourism Management Department",
          "Tourism Management",
          "What  are offered in the Tourism Management Department?",
          "in the Tourism Management Department",
          "Tourism",
          "TM",
          "I would like to know about curriculum in Tourism",
          "I want to get into Tourism. Show me Tourism courses",
          "What are available in Tourism Management Department?",
          "Tell me more about Tourism Management Department",
          "What do you have in Tourism Management?"
      ],
      "responses": [
          "Here are the courses available in the Tourism Management Department:\n1. Bachelor of Science in Tourism Management"
      ]
  }, 
  {
    "tag": "course_selection_BSITTM",
    "patterns": [
        "BSITTM",
        "BSITTM - Bachelor of Science in International Tourism and Travel Management", 
        "Bachelor of Science in International Tourism and Travel Management", 
        "What are the courses available for BSITTM", 
        "What are the courses offered in Bachelor of Science in International Tourism and Travel Management"
    ],
    "responses": [
        "A graduate of International Tourism and Travel Management is proficient in effective communication, executing tasks in diverse environments, problem-solving, and critical thinking within the tourism and hospitality industry. They uphold professional and ethical standards while delivering customer service, utilizing relevant technology applications, and leading advocacy programs for industry enhancement. Their skills extend to organizing tours, conducting insightful research, designing innovative marketing programs, and evaluating tourism sites for sustainability and socio-cultural impact, all aligned with national and international standards.\nDepartment of Tourism (DOT)\nTourism Infrastructure and Enterprise Zone Authority\nTourism Promotions Board\nRegional Officer of the Department of Tourism\nTourist Information Center Manager\nTourism Officer of City or Municipal Tourism Office\nTour Operator\nTour Leader\nTourism Marketing Officer\nTravel Agent\nTravel Agency Manager\nTravel Consultant"
    ]
  },
  {
      "tag": "campus_location",
      "patterns": [
          "Where are the main buildings located on Makati campus?",
          "Can you tell me the location of main buildings on Makati campus?",
          "Where can I find the main buildings on Makati campus?",
          "Location of main buildings on Makati campus",
          "Main buildings on Makati campus",
          "Where can I find the school?",
          "Where is the Gil Puyat campus and where is the Legazpi Village campus?",
          "Location",
          "Where can I find the school?",
          "location",
          "location of school",
          "location of CEU Makati"
      ],
      "responses": [
          "CEU Makati has 2 campuses: \n The Gil Puyat campus is located at 259 Sen. Gil J. Puyat Ave, Makati, 1203 Metro Manila \n The Legazpi Village campus is located at 103 Esteban Street, Legazpi village, Makati, Kalakhang Maynila."
      ]
  },
  {
    "tag": "gp_ground_floor",
    "patterns": [
        "gp ground floor",
        "What are the departments in gp ground floor",
        "What are the offices in gp ground floor"
    ],
    "responses": [
        "List of Offices and Departments found in the ground floor of CEU GP\n\n1. Information & Human Resources Section\n2. Admission Section\n3. Registrars Office\n4. Information and Communications Technology Section\n5. Alumni Office\n6. Marketing and Communication, Career Services and Placement Section\n7. Pharmacy Department Office\n8. Vice-Presidents Office\n9. Health Services Section\n10. Student Affairs Unit\n11. Cash & Accounting Section\n12. Property and Administration Office\n13. Office of the Dean, School of Law and Jurisprudence\n14. Security Section\n15. Physical Plant and Facilities Section\n16. Canteen\n17. Parking Area"
    ]
  }, 
  {
    "tag": "gp_second_floor",
    "patterns": [
        "gp second floor",
        "What are the departments in gp second floor",
        "What are the offices in gp second floor"
    ],
    "responses": [
        "List of Offices and Departments found in the second floor of CEU GP\n\n1. Office of the School of Law and Jurisprudence\n2. Law Library\n3. Office of the Associate Dean, School of law and jurisprudence\n4. Law Faculty Room\n5. Moot Court\n6. Office of the Legal Aid\n7. College Faculty Room\n8. Consultation Room"
    ]
  },
  {
    "tag": "gp_third_floor",
    "patterns": [
        "gp third floor",
        "What are the departments in gp third floor",
        "What are the offices in gp third floor"
    ],
    "responses": [
        "List of Offices and Departments found in the third floor of CEU GP\n\n1. Student Activity Center\n2. CEU Consumers Cooperative\n3. Community Outreach Section\n4. Campus Library\n5. Teaching and Learning Technology Section\n6. Multimedia Instructional Room\n7. Office of the Spiritual Adviser\n8. Chapel"
    ]
  },
  {
    "tag": "gp_fourth_floor",
    "patterns": [
        "gp fourth floor",
        "What are the departments in gp fourth floor",
        "What are the offices in gp fourth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the fourth floor of CEU GP\n\n1. Guidance and Counseling Section\n2. Testing Room\n3. Pharmacy Simulation Room"
    ]
  },
  {
    "tag": "gp_fifth_floor",
    "patterns": [
        "gp fifth floor",
        "What are the departments in gp fifth floor",
        "What are the offices in gp fifth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the fifth floor of CEU GP\n\n1. Senior High School Department\n2. Senior High School Classrooms"
    ]
  },
  {
    "tag": "gp_sixth_floor",
    "patterns": [
        "gp sixth floor",
        "What are the departments in gp sixth floor",
        "What are the offices in gp sixth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the sixth floor of CEU GP\n\n1. Medical Technology Department Office\n2. Pharmacy Manufacturing Laboratory\n3. Research Section"
    ]
  },
  {
    "tag": "gp_seventh_floor",
    "patterns": [
        "gp seventh floor",
        "What are the departments in gp seventh floor",
        "What are the offices in gp seventh floor"
    ],
    "responses": [
        "List of Offices and Departments found in the seventh floor of CEU GP\n\n1. Weighing Room\n2. Chemical Dispensing Room\n3. Instrumentation Room 3\n4. Instrumentation Room 4"
    ]
  },
  {
    "tag": "gp_eighth_floor",
    "patterns": [
        "gp eighth floor",
        "What are the departments in gp eighth floor",
        "What are the offices in gp eighth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the eighth floor of CEU GP\n\n1. Instrumentation Room 1\n2. Instrumentation Room 2\n3. Instrumentation Room 5\n4. Specimen Room\n5. Animal Holding Facility"
    ]
  }, 
  {
    "tag": "gp_ninth_floor",
    "patterns": [
        "gp ninth floor",
        "What are the departments in gp ninth floor",
        "What are the offices in gp ninth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the ninth floor of CEU GP\n\n1. Nursing Department Office\n2. Nursing Arts Laboratories"
    ]
  },
  {
    "tag": "lv_ground_floor",
    "patterns": [
        "lv ground floor",
        "What are the departments in lv ground floor",
        "What are the offices in lv ground floor"
    ],
    "responses": [
        "List of Offices and Departments found in the ground floor of CEU LV\n\n1. Lobby and the Information Area\n2. Registrar's Office\n3. Accounting and Cash Section\n4. Property and Administration Office\n5. The Student Affairs Unit\n6. The Tourism Travel Bureau"
    ]
  }, 
  {
    "tag": "lv_second_floor",
    "patterns": [
        "lv second floor",
        "What are the departments in lv second floor",
        "What are the offices in lv second floor"
    ],
    "responses": [
        "List of Offices and Departments found in the second floor of CEU LV\n\n1. Accountancy and Management Department Office\n2. Assistant Dean's Office\n3. The Health Services Section\n4. AMD Case Presentation Room"
    ]
  },
  {
    "tag": "lv_third_floor",
    "patterns": [
        "lv third floor",
        "What are the departments in lv third floor",
        "What are the offices in lv third floor"
    ],
    "responses": [
        "List of Offices and Departments found in the third floor of CEU LV\n\n1. Dentistry Department Office\n2. Dentistry Clinical Infirmary\n3. X-Ray Room\n4. The Developing Room\n4a. Clinical Conference Room\n4b. Sterilization Area"
    ]
  },
  {
    "tag": "lv_fourth_floor",
    "patterns": [
        "lv fourth floor",
        "What are the departments in lv fourth floor",
        "What are the offices in lv fourth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the fourth floor of CEU LV\n\n1. Dentistry Laboratory  Rooms\n2. Simulation Room\n3. Dentistry Stock Room"
    ]
  },
  {
    "tag": "lv_fifth_floor",
    "patterns": [
        "lv fifth floor",
        "What are the departments in lv fifth floor",
        "What are the offices in lv fifth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the fifth floor of CEU LV\n\n1. Dentistry Laboratory Rooms\n2. Dentistry Lecture Room\n3. Students Waiting Area"
    ]
  },
  {
    "tag": "lv_sixth_floor",
    "patterns": [
        "lv sixth floor",
        "What are the departments in lv sixth floor",
        "What are the offices in lv sixth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the sixth floor of CEU LV\n\n1. Canteen\n2. Chapel"
    ]
  },
  {
    "tag": "lv_seventh_floor",
    "patterns": [
        "lv seventh floor",
        "What are the departments in lv seventh floor",
        "What are the offices in lv seventh floor"
    ],
    "responses": [
        "List of Offices and Departments found in the seventh floor of CEU LV\n\n1. Teaching and Learning Technology Section\n2. Multimedia Instruction Room\n3. Library Section"
    ]
  },
  {
    "tag": "lv_eighth_floor",
    "patterns": [
        "lv eighth floor",
        "What are the departments in lv eighth floor",
        "What are the offices in lv eighth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the eighth floor of CEU LV\n\n1. Psychology Department Office\n2. Students Waiting Area\n3. Wellness Nook"
    ]
  }, 
  {
    "tag": "lv_ninth_floor",
    "patterns": [
        "lv ninth floor",
        "What are the departments in lv ninth floor",
        "What are the offices in lv ninth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the ninth floor of CEU LV\n\n1. Computer Science and Information Technology Department Office\n2. Computer Laboratory Rooms\n3. The Information Communication and Technology Section"
    ]
  }, 
  {
    "tag": "lv_tenth_floor",
    "patterns": [
        "lv tenth floor",
        "What are the departments in lv tenth floor",
        "What are the offices in lv tenth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the tenth floor of CEU LV\n\n1. Tourism Management Department Office\n2. Lecture Rooms\n3. Students Waiting Area"
    ]
  }, 
  {
    "tag": "lv_eleventh_floor",
    "patterns": [
        "lv eleventh floor",
        "What are the departments in lv eleventh floor",
        "What are the offices in lv eleventh floor"
    ],
    "responses": [
        "List of Offices and Departments found in the eleventh floor of CEU LV\n\n1. Hotel Management Department Office\n2. Food Laboratories"
    ]
  }, 
  {
    "tag": "lv_twelfth_floor",
    "patterns": [
        "lv twelfth floor",
        "What are the departments in lv twelfth floor",
        "What are the offices in lv twelfth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the twelfth floor of CEU LV\n\n1. Mock Hotel"
    ]
  }, 
  {
    "tag": "lv_fourteenth_floor",
    "patterns": [
        "lv fourteenth floor",
        "What are the departments in lv fourteenth floor",
        "What are the offices in lv fourteenth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the fourteenth floor of CEU LV\n\n1. Faculty Room\n2. The Consultation Room\n3.The Management Simulation Room\n4. Guidance and Counseling Section\n5. Psychology Laboratory"
    ]
  },
  {
    "tag": "lv_fifteenth_floor",
    "patterns": [
        "lv fifteenth floor",
        "What are the departments in lv fifteenth floor",
        "What are the offices in lv fifteenth floor"
    ],
    "responses": [
        "List of Offices and Departments found in the fifteenth floor of CEU LV\n\n1. Student Activity Center"
    ]
  },
  {
      "tag": "parking_facilities",
      "patterns": [
          "Are there any parking facilities available for students on campus?",
          "Do students have access to parking facilities on campus?",
          "Parking facilities for students on campus",
          "Student parking on campus",
          "Can I park my car in any of the campuses?",
          "I plan on driving to school. Can I park my car in any of the campuses?"
      ],
      "responses": [
          "Yes, there are parking facilities available for students on campus."
      ]
  },
  {
      "tag": "student_clubs_organizations",
      "patterns": [
          "What are the available student clubs and organizations?",
          "Can you provide information about student clubs and organizations?",
          "List of student clubs and organizations",
          "Student clubs and organizations",
          "Give me the available student clubs and organizations that the school offers",
          "Tell me more about the student clubs and organizations",
          "What do you have in student clubs and organizations?"
      ],
      "responses": [
          "Student Clubs:\n- Community Outreach Movement Pro-Active Students Service (COMPASS)\n- Dramatic Guild\n- Honors Society\n- Peer Facilitators Group\n- Photographers Club\n- Red Cross Youth\n- Science Club\n- Student Catholic Action\n\nStudent Organizations:\n- Management Students Association (MASA)\n- Junior Philippine Computer Society (JPCS)\n- Dental Clinicians Club (DCC)\n- Philippine Dental Students Association (PDSA)\n- Philippine Society of Medical Technology Students (PHISMETS)\n- Association of Hotel and Restaurant Management Students (AHRMS)\n- Association of Tourism Students (ATS)\n- Junior Philippine Pharmacists Association (JPPhA)- CEU Beta Chapter\n- Psychology Society"
      ]
  },
  {
      "tag": "scholarship_opportunities",
      "patterns": [
          "Are there any scholarship opportunities available for students?",
          "Do you offer scholarships for students?",
          "Scholarship opportunities for students",
          "Available scholarships for students"
      ],
      "responses": [
          "Various scholarship programs are available to qualified students, be they entering freshmen or continuing students. Freshmen may avail of a scholarship, which is renewable upon fulfillment of certain requirements. In addition, continuing students may apply for scholarships funded by the University itself, alumni and friends of the University, and some corporations with interests in the University.\n\nThe University also provides financial grants to students who participate in extracurricular activities such as extramural, membership in the choir, leadership in student councils, or other similar groups.\n\nOnly one scholarship or financial grant shall be enjoyed by any student. In case a student is qualified for more than one university scholarship or grant, he/she may avail himself/herself of the higher or more generous grant."
      ]
  },
  {
      "tag": "study_spaces",
      "patterns": [
          "Are there designated study spaces or quiet zones on campus?",
          "Do you have study spaces or quiet zones on campus?",
          "Designated study areas on campus",
          "Quiet zones on campus",
          "Where are available spaces for focused study?",
          "Show me places to do heavy focused study",
          "Where are designated study spaces on campus?" 
      ],
      "responses": [
          "Yes, there are designated study spaces and quiet zones on campus. The primary locations for focused study include the library and discussion rooms inside the library, providing students with conducive environments for academic work and research."
      ]
  },
  {
      "tag": "on_campus_dining",
      "patterns": [
          "Are there on-campus dining options for students?",
          "Do you have on-campus dining facilities?",
          "Dining options on campus",
          "Where to eat on campus?",
          "Available food areas on campus?",
          "I want to hangout with friends and eat together. Show me dining options on campus"
      ],
      "responses": [
          "Yes, there are on-campus dining options for students. In the GP building, you can find dining facilities on the 3rd floor and also on the ground floor. Meanwhile, in the LV building, the dining options are located on the 6th floor."
      ]
  },
  {
      "tag": "public_transportation",
      "patterns": [
          "What public transportation options are available near the campus?",
          "Transportation options near campus",
          "Public transportation near the campus",
          "Are there any public transportation options near the campus?",
          "Availability of public transpo"
      ],
      "responses": [
          "For the GP campus, students have easy access to a wide range of public transportation options. However, at the LV campus, while most transportation is conveniently within a 5-minute walk, it's worth noting that train transportation will only be accessible after a 20-minute walk."
      ]
  },
  {
      "tag": "wifi_access",
      "patterns": [
          "How can I access the university's Wi-Fi network on campus?",
          "Wi-Fi access on campus",
          "Connecting to campus Wi-Fi",
          "Can I access the school wifi even I'm not enrolled?",
          "How do I connect to the university's Wi-Fi network on campus?",
          "Wifi",
          "Wi-Fi",
          "wifi",
          "Wi-Fi on campus"
      ],
      "responses": [
          "To connect to the university's Wi-Fi network on campus, enrollment is a prerequisite. Upon enrollment, you can gain access by providing your student ID and date of birth. Following this, the university will issue you a personalized username and password, facilitating your connection to the campus Wi-Fi."
      ]
  },

  {
    "tag": "profanity_messages",
    "patterns": [
        "Fuck you",
        "Shut up",
        "shut the fuck up",
        "tite",
        "pakyu",
        "nigger",
        "nigga",
        "shit",
        "bitch",
        "asshole",
        "dickhead",
        "cunt",
        "cuntface",
        "whore",
        "ass",
        "asshole",
        "dickhead",
        "tangina mo",
        "putangina mo",
        "go fuck yourself",
        "bobo mo",
        "gago ka",
        "tangina mo gago",
        "go kill yourself",
        "tangina mo gago ka",
        "dick",
        "dickhead",
        "dick face",
        "dickhead face",
        "dick face",
        "dickhead face",
        "dick",
        "dickhead",
        "dick face"
    ],
    "responses": [
        "Aww :(( \n Please refrain from using any profanity in this chatbot."    
    ]
},
{
    "tag": "etcetra_stuff",
    "patterns": [
        "lol",
        "lmao",
        "lmaoo",
        "lmaooo",
        "lmaoooo",
        "lmaooooo",
        "HAHAHAHAH",
        "haha",
        "adfaskfaskdfaskfd",
        "erqiwrqiwr"
    ],
    "responses": [
        "I'm sorry, I don't understand. Please type something else or click the buttons."      
    ]
},
{
    "tag": "admissions_opening",
    "patterns": [
        "When is the opening of admissions for School Year 2024-2025?"
    ],
    "responses": [
        "Admissions for SY 2024-2025 are ongoing until August 2024. Please click <a href='https://admission2.ceu.edu.ph/' target='_blank' style='text-decoration: underline; color: white'>here</a> for your online application."
    ]
},
{
    "tag": "entrance_exams",
    "patterns": [
        "Will CEU conduct entrance exams for SY 2024-2025?"
    ],
    "responses": [
        "NO ENTRANCE EXAMINATION for the school year 2024-2025."
    ]
},
{
    "tag": "application_process",
    "patterns": [
        "How do I apply for Admission?"
    ],
    "responses": [
        "To apply for admission, please click <a href='https://admission2.ceu.edu.ph/' target='_blank' style='text-decoration: underline; color: white'>here</a> for your online application."
    ]
},
{
    "tag": "admission_requirements",
    "patterns": [
        "What are the admission requirements for the first year undergraduate applicants?"
    ],
    "responses": [
        "The admission requirements for first-year undergraduate applicants are the following: Original Form 138 for Grade 12 Report Card/PEPT Result/ ALSA & E Result, Certificate of Good Moral Character from High School Principal, and Certified True Copy of Birth Certificate."
    ]
},
{
    "tag": "matriculation_fees",
    "patterns": [
        "May I ask for the list of matriculation fees?"
    ],
    "responses": [
        "Please click <a href='https://admission2.ceu.edu.ph/summary-fees-freshmen-%E2%80%93-1st-semester-sy-2024-2025-manila' target='_blank' style='text-decoration: underline; color: white'>here</a> for the list of matriculation fees. You may also email the CEU Accounting Department for other concerns regarding the fees: CEU Manila - <a href='mailto:accountingdept@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>accountingdept@ceu.edu.ph</a>, CEU Makati - <a href='mailto:accounting_cash_section@mkt.ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white' >accounting_cash_section@mkt.ceu.edu.ph</a>, CEU Malolos - <a href='mailto:accounting_cash_section@mls.ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>accounting_cash_section@mls.ceu.edu.ph</a>."
    ]
},
{
    "tag": "application_fee_payment",
    "patterns": [
        "How do I pay the Application Fee?"
    ],
    "responses": [
        "Please click <a href='https://portal.paynamics.biz/redirect_inventory/AJJI1neOipS4q6yB8dUJjM' target='_blank' style='text-decoration: underline; color: white'>here</a> for the online payment of the application fee."
    ]
},
{
    "tag": "application_fee_payment",
    "patterns": [
        "How do I pay the Application Fee?"
    ],
    "responses": [
        "Please click <a href='https://portal.paynamics.biz/redirect_inventory/AJJI1neOipS4q6yB8dUJjM' target='_blank'>here</a> for the online payment of the application fee."
    ]
},
{
    "tag": "application_status",
    "patterns": [
        "I already submitted my Application Form on your website, but I did not receive any email on the status of my application. What steps do I need to follow?"
    ],
    "responses": [
        "On your dashboard, you need to submit the following admission requirements in Step 3: Original Form 138 for Grade 12 Report Card/PEPT Result/ALS A&E Result, Certificate of Good Moral Character from High School Principal, Certified True Copy of Birth Certificate. Please email the Admission Section using the following CEU email address below for more information: CEU Manila: <a href='mailto:ceuadmission@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>ceuadmission@ceu.edu.ph</a>, CEU Makati: <a href='mailto:ceumakatiadmission@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>ceumakatiadmission@ceu.edu.ph</a>, CEU Malolos: <a href='mailto:ceuadmissionmalolos@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>ceuadmissionmalolos@ceu.edu.ph</a>."
    ]
},
{
    "tag": "application_form_edit",
    "patterns": [
        "Where can I edit my online Application Form?"
    ],
    "responses": [
        "Please log in to your applicant account in the CEU Website to update your Application Form."
    ]
},
{
    "tag": "qualification_enrollment",
    "patterns": [
        "How will I know if I am qualified to enroll?"
    ],
    "responses": [
        "You will receive an approval about your admission in Step 3 after you upload your admission requirements."
    ]
},
{
    "tag": "birth_certificate_submission",
    "patterns": [
        "Can I pass the NSO Birth Certificate instead of PSA Birth Certificate for my online application?"
    ],
    "responses": [
        "Yes, you can submit your NSO birth certificate."
    ]
},
{
    "tag": "application_fee_convenience",
    "patterns": [
        "Is the convenience fee already included in the Application Fee of Php 350?"
    ],
    "responses": [
        "Yes, the convenience fee is already included in the application fee. You can pay the said fee using this link <a href='https://portal.paynamics.biz/redirect_inventory/AJJI1neOipS4q6yB8dUJjM' target='_blank' style='text-decoration: underline; color: white'>here</a>."
    ]
},
{
    "tag": "good_moral_character_submission",
    "patterns": [
        "Where can I submit my Certificate of Good Moral Character and High School Card?"
    ],
    "responses": [
        "You will upload the requirements in Step 3 on your dashboard."
    ]
},
{
    "tag": "scholarships_grants",
    "patterns": [
        "What are the Scholarships/Grants available in CEU?"
    ],
    "responses": [
        "Please click this link <a href='https://www.ceu.edu.ph/admission-subpages/20' target='_blank' style='text-decoration: underline; color: white'>here</a> for the available scholarships and grants."
    ]
},
{
    "tag": "semester_dates",
    "patterns": [
        "When is the start and the end of the First Semester, School Year 2024-2025?"
    ],
    "responses": [
        "The start of classes for the First Semester, SY 2024-2025 will be in August 2024."
    ]
},
{
    "tag": "online_learning_platform",
    "patterns": [
        "What platform will be used in online learning?"
    ],
    "responses": [
        "All students will use CEU LEAPS (LEARNING ENHANCEMENTS AND PROFICIENCY SYSTEMS) Platform."
    ]
},
{
    "tag": "computer_requirements",
    "patterns": [
        "What are the requirements for a laptop or desktop to go online?"
    ],
    "responses": [
        "The following are minimum requirements: OS- WINDOWS 7, 2 GHZ PROCESSOR, 1 GB RAM, BROWSER- GOOGLE CHROME, and INTERNET SPEED- 2 MBPS."
    ]
},
{
    "tag": "leaps_support",
    "patterns": [
        "What will I do if I have concern/s regarding the CEU LEAPS?"
    ],
    "responses": [
        "A student who has concerns in CEU LEAPS must send an email to the following CEU LEAPS SUPPORT email address: CEU Manila: <a href='mailto:tltdsupport@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>tltdsupport@ceu.edu.ph</a>, CEU Makati: <a href='mailto:tltsmakati@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>tltsmakati@ceu.edu.ph</a>, CEU Malolos: <a href='mailto:tltsmls@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>tltsmls@ceu.edu.ph</a>."
    ]
},
{
    "tag": "ceu_email_account",
    "patterns": [
        "What is the use of a CEU email account?"
    ],
    "responses": [
        "The CEU email account, that can be found in Step 4, shall be used for all your official CEU communications, announcements, important activities, and messages."
    ]
},
{
    "tag": "installment_payment_schedule",
    "patterns": [
        "Where can I get the schedule of payments if I choose installment basis?"
    ],
    "responses": [
        "The schedule of payment of fees if you choose installment basis is reflected on the Certificate of Matriculation (COM) which will be given during the enrollment. The Accounting Department/Section will send a Statement of Account (SOA) two (2) weeks before the scheduled payment of fees. You may email the CEU Accounting Department/Section: CEU Manila - <a href='mailto:accountingdept@ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>accountingdept@ceu.edu.ph</a>, CEU Makati - <a href='mailto:accounting_cash_section@mkt.ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>accounting_cash_section@mkt.ceu.edu.ph</a>, CEU Malolos - <a href='mailto:accounting_cash_section@mls.ceu.edu.ph' target='_blank' style='text-decoration: underline; color: white'>accounting_cash_section@mls.ceu.edu.ph</a>."
    ]
},
{
    "tag": "grading_system",
    "patterns": [
        "What is the Grading System this school year?"
    ],
    "responses": [
        "There will be two (2) grading periods: Midterm and Finals. The Class Participation grade will be composed of reports, quizzes, assignments, etc. which is multiplied by 2 and the Periodic Examination grade is multiplied by 1. These two will be added and will be divided by 3. The passing grade is 3.00. The grade of 4.00 is conditional and 5.00 is a failing mark."
    ]
},
{
    "tag": "subject_cut_off_grades",
    "patterns": [
        "What are the cut off grades for the different subjects?"
    ],
    "responses": [
        "The cut-off grade for General Education subjects is 50%, 65% for the Professional Core subjects, and 70 % for the Professional subjects. The teacher will inform you on the cut off for each subject."
    ]
},
{
    "tag": "bukas_application",
    "patterns": [
        "How can I apply for Bukas.ph?"
    ],
    "responses": [
        "CEU partnered with Bukas.ph to provide the CEU students with tuition installment plans payable in 12 low monthly payments. With Bukas tuition plans, you can get up to P50,000 worth of tuition loan covered by Bukas in as fast as 3 to 5 days. Interested students may visit the Bukas website: <a href='https://bukas.ph/partners/ceu/' target='_blank' style='text-decoration: underline; color: white'>https://bukas.ph/partners/ceu/</a> to apply or use the online calculator to get a FREE quotation."
    ]
},
{
    "tag": "connectivity_plans",
    "patterns": [
        "How can I avail of discounted connectivity plans from the CEU Smart Online Store?"
    ],
    "responses": [
        "Experience effortless shopping + FREE shipping nationwide by logging on to the following URLs using your CEU issued email: CEU Manila: <a href='http://ceu.smart' target='_blank' style='text-decoration: underline; color: white'>http://ceu.smart</a>, CEU Makati: <a href='http://makati.ceu.smart' target='_blank' style='text-decoration: underline; color: white'>http://makati.ceu.smart</a>, CEU Malolos: <a href='http://malolos.ceu.smart' target='_blank' style='text-decoration: underline; color: white'>http://malolos.ceu.smart</a>"
    ]
},
{
    "tag": "submission_deadline",
    "patterns": [
        "When is the deadline for the submission of the hard copies of the original admission credentials?"
    ],
    "responses": [
        "The deadline for the submission of the hard copies of the admission credentials is on November 15, 2024."
    ]
},
{
    "tag": "class_conduct",
    "patterns": [
        "How are the classes conducted?"
    ],
    "responses": [
        "Please click this link <a href='https://admission2.ceu.edu.ph/' target='_blank' style='text-decoration: underline; color: white'>here</a> under University Life of Mode of Instruction on how classes are conducted in CEU."
    ]
},
{
    "tag": "online_attire",
    "patterns": [
        "What attire will I wear during the online classes?"
    ],
    "responses": [
        "CEU will provide a white polo shirt that you can use during your online classes."
    ]
},
{
    "tag": "payment_plans",
    "patterns": [
        "What are the different payment plans available?"
    ],
    "responses": [
        "Plan A: Cash or Full payment, less 2% discount. Plan B: Down payment of Php 20,000 pesos upon enrollment plus one-time 600 pesos, balance payable in 4 installments (25%). Plan C: Down payment of Php 10,000 pesos upon enrollment plus one-time 600 pesos, balance payable in 4 installments (25%). Plan D: Down payment of Php 5,000 pesos upon enrollment plus one-time 600 pesos, balance payable in 4 installments (25%). Plan E: Down payment of any amount higher than Php 5000 plus one-time 600 pesos, balance payable in 4 installments (25%)."
    ]
},
{
    "tag": "leaps_access",
    "patterns": [
        "How do I access CEU LEAPS?"
    ],
    "responses": [
        "Kindly click the link for the steps to access the CEU LEAPS: <a href='https://drive.google.com/file/d/1Q__MRJZEcJ7IjG1-zJmZm2mSxs3ioGzs/view?usp=sharing' target='_blank' style='text-decoration: underline; color: white'>https://drive.google.com/file/d/1Q__MRJZEcJ7IjG1-zJmZm2mSxs3ioGzs/view?usp=sharing</a>."
    ]
},
{
    "tag": "university_orientation",
    "patterns": [
        "Do you have University Orientation?"
    ],
    "responses": [
        "The schedule of the University Orientation will be posted to your dashboard or sent through your CEU Email Account."
    ]
},
{
    "tag": "job_application",
    "patterns": [
        "Job Application CEU Careers",
        "How do I apply for a job at CEU?",
        "CEU job opportunities",
        "Career opportunities at CEU",
        "CEU job vacancies",
        "Where can I find job openings at CEU?"
    ],
    "responses": [
        "For job applications and career opportunities at CEU, please visit the CEU Careers page: <a href='https://www.ceu.edu.ph/ceu-careers' target='_blank' style='text-decoration: underline; color: white'>CEU Careers</a>. For more inquiries, please contact the Human Resource Department at Ground Flr., Pilar Hidalgo Lim Bldg. 9 Mendiola St., San Miguel, Manila Philippines 1005. Phone: +(63)2 8735-6861 loc. 244, Telefax: +(63)2 8735-9403, Email: hrdrecruitment@ceu.edu.ph"
    ]
},
{
    "tag": "online_shop",
    "patterns": [
        "CEU Makati Online Shop",
        "Where can I buy CEU merchandise online?",
        "CEU merchandise store",
        "How do I purchase items from CEU online shop?"
    ],
    "responses": [
        "For CEU merchandise and online shopping, please visit the CEU Makati Online Shop: <a href='https://www.ceu.edu.ph/ceu-shoppe' target='_blank' style='text-decoration: underline; color: white'>CEU Makati Online Shop</a>."
    ]
},
{
    "tag": "university_calendar",
    "patterns": [
        "University Calendar",
        "CEU academic calendar",
        "When does the academic year start at CEU?",
        "CEU term dates"
    ],
    "responses": [
        "For the CEU academic calendar and term dates, please refer to the University Calendar: <a href='https://www.ceu.edu.ph/academics/academic-calendar/index' target='_blank' style='text-decoration: underline; color: white'>University Calendar</a>."
    ]
},
{
    "tag": "university_research",
    "patterns": [
        "University Research",
        "CEU research projects",
        "Research opportunities at CEU",
        "CEU research initiatives"
    ],
    "responses": [
        "To learn more about university research projects and initiatives at CEU, please visit the University Research page: <a href='https://www.ceu.edu.ph/academics/university-research/index' target='_blank' style='text-decoration: underline; color: white'>University Research</a>."
    ]
},
{
    "tag": "financial_grants",
    "patterns": [
        "Financial Grants",
        "Participation in University Activities Grants",
        "CEU financial assistance",
        "How can I apply for financial grants at CEU?"
    ],
    "responses": [
        "For information about financial grants and assistance for participation in university activities, please visit the Financial Grants page: <a href='https://www.ceu.edu.ph/campus-life/6' target='_blank' style='text-decoration: underline; color: white'>Financial Grants</a>."
    ]
},
{
    "tag": "ceu_facebook",
    "patterns": [
        "Centro Escolar University Official Facebook Page",
        "CEU Facebook",
        "CEU official social media",
        "CEU Facebook updates"
    ],
    "responses": [
        "Stay updated with the latest news and updates from Centro Escolar University by following our official Facebook page: <a href='https://www.facebook.com/theCEUofficial' target='_blank' style='text-decoration: underline; color: white'>Centro Escolar University Official Facebook Page</a>."
    ]
},
{
    "tag": "makati_usc_facebook",
    "patterns": [
        "CEU Makati University Student Council Makati Facebook Page",
        "CEU Makati USC Facebook",
        "CEU Makati Student Council updates",
        "CEU Makati Student Council events"
    ],
    "responses": [
        "For updates and events from the CEU Makati University Student Council, visit their Facebook page: <a href='https://www.facebook.com/CEUMakatiUSC' target='_blank' style='text-decoration: underline; color: white'>CEU Makati University Student Council Makati Facebook Page</a>."
    ]
},

{
    "tag": "AMD_Permanent_Faculty_Members",
    "patterns": [
        "Permanent AMD Faculty Members"
    ],
    "responses": [
        "Here are the permanent AMD Faculty Members: \n Antonio, Rowel E. \n Azul, Alnee Joy A. \n Cruz, Bessie L. \b Dee, Anabelle P. \n Edulag, Dominadora I. \n Joson, Roy Raian A. \n Lagazon, Marcus \n Alphonsus O. \n Lumpas, Ricardo S. "
    ]
    
},

{
    "tag": "AMD_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term AMD Faculty Members"
    ],
    "responses": [
        "Here are the fixed term AMD Faculty Members: Faronal, Ivan N. \n Bellaflor, Danica C. \n Ingua, Gener V. \n Salamat, Ramill Paolo B. \n Ballecer, Julieta C. \n Lagrimas, Albert A. \n Valenzuela, John Roderick "
    ]
    
},

{
    "tag": "AMD_Lecturer_Faculty_Members",
    "patterns": [
        "AMD Lecturer"
    ],
    "responses": [
        "Here are the AMD Lecturer Faculty Members: Garciano, Maria Corazon D. \n Marquez, Allan C. \n Mercado, Jennica Marielle P. \n Parcia, Jacquilene Kristine B. \n Ramos, Jayson O.S. "
    ]
    
},

{
    "tag": "CSIT_Permanent_Faculty_Members",
    "patterns": [
        "Permanent CSIT Faculty Members"
    ],
    "responses": [
        "Here is the Permanent CSIT Faculty Member: \n Florentino, Ma. Christina A."
    ]
    
},

{
    "tag": "CSIT_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term CSIT Faculty Members"
    ],
    "responses": [
        "I'm sorry. Currently, there are no Fixed Term CSIT Faculty Members."
    ]
    
},

{
    "tag": "CSIT_Lecturer_Faculty_Members",
    "patterns": [
        "Lecturer CSIT Faculty Members"
    ],
    "responses": [
        "Here are the Lecturer CSIT Faculty Members: \n Abarro, Rico Sancho G. \n Caete, Zharinna Marie L. \n Mercado, Dave B."
    ]
    
},

{
    "tag": "Dentistry_Permanent_Faculty_Members",
    "patterns": [
        "Permanent Dentistry Faculty Members"
    ],
    "responses": [
        "Here are the Permanent Dentistry Faculty Members: De Luna-Gappi, Jennifer Charlotte A. \n Flores, Peter \n Mariscal, Glyn M. \n Martinez, Maria Wanda I. \n Morales, Erika \n Sancheze, Carmen P. \n Tiongco, Ryan G."
    ]
    
},

{
    "tag": "Dentistry_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term Dentistry Faculty Members"
    ],
    "responses": [
        "Here are the Fixed Term Dentistry Faculty Members: Almerido-Sasam, Raphaelli Carla L. \n De Guzman, Angelyn G. \n Tablarin, Shan Gayle Ann S. \n Tamaray, Russell Bruce"
    ]
    
},

{
    "tag": "Dentistry_Lecturer_Faculty_Members",
    "patterns": [
        "Lecturer Dent Dentistry Faculty Members"
    ],
    "responses": [
        "Here are the Lecturer Dentistry Faculty Members: Acosta, Jane Erica P. \n Baniqued, Loida C. \n Capuno, Alexander C. \n Del Castillo, Jenica Lyn \n De Ocampo, Anjelique Marih F. \n Manalaysay, Mendelssohn T. \n Salazar-Ferraris, Simmone E."
    ]
    
},

{
    "tag": "HM_Permanent_Faculty_Members",
    "patterns": [
        "HM Permanent Faculty Members"
    ],
    "responses": [
        "Here are the Permanent HM Faculty Members: Gallardo, Ronald M. \n Mijares, Luzette T. \n Tamayo, Honey Liza C. "
    ]
    
},

{
    "tag": "HM_Fixed_Term_Faculty_Members",
    "patterns": [
        "HM Fixed Term Faculty Members"
    ],
    "responses": [
        "I'm sorry. Currently, there are no Fixed Term HM Faculty Members."
    ]
    
},

{
    "tag": "Medtech_Permanent_Faculty_Members",
    "patterns": [
        "Permanent MedTech faculty Members"
    ],
    "responses": [
        "Here is the Permanent MedTech Faculty Member: \n Dizon, Maria Carmen S."
    ]
    
},

{
    "tag": "Medtech_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term MedTech faculty Members"
    ],
    "responses": [
        "Here are the Fixed Term MedTech Faculty Member: \n Esteban, Maria Redora R. \n Manzon, Aurea P. \n Rota, Hyacinth A. \n Santos, Marielle Louise B. \n Sumugat, Michael O. "
    ]
    
},

{
    "tag": "Medtech_Lecturer_Faculty_Members",
    "patterns": [
        "Lecturer MedTech faculty Members"
    ],
    "responses": [
        "Here is the Lecturer MedTech Faculty Member: \n Suriaga, Christian Dhale M."
    ]
    
},

{
    "tag": "Nursing_Permanent_Faculty_Members",
    "patterns": [
        "Permanent Nursing Faculty Members"
    ],
    "responses": [
        "Here are the Permanent Nursing Faculty Members: \n Casilang, Aubreyrose J. \n Coloma, Maria Victoria S. \n Jardeleza, Aldrin V. \n Lacopia, Jobbie S. \n Lonton, Mae Angeline M."
    ]
    
},

{
    "tag": "Nursing_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term Nursing Faculty Members"
    ],
    "responses": [
        "Here are the Fixed Term Nursing Faculty Members: \n Al-Mahdhaly, Aqeel Adnan C \n Borja, Allen Ray S. \n Carreon, Emily Jane F. \n Del Pilar, Luz V. \n Lavin, Keith Nester A."
    ]
    
},

{
    "tag": "Nursing_Lecturer_Faculty_Members",
    "patterns": [
        "Lecturer Nursing Faculty Members"
    ],
    "responses": [
        "Here are the Lecturer Nursing Faculty Members: \n Bartolay, Miriam L. \n Cerrero, Jamaiaca Rose L. \n Cristino, Mark Angelo T. \n Gamas, Pedriluz Joy Love S. \n Topacio, Ronalyn D."
    ]
    
},

{
    "tag": "Pharmacy_Permanent_Faculty_Members",
    "patterns": [
        "Permanent Pharmacy Faculty Members"
    ],
    "responses": [
        "Here are the Permanent Pharmacy Faculty Members: \n Cera, Eugene Marc III D. \n Dean, Maria Donnabelle U. \n Limuaco, Olivia M."
    ]
    
},

{
    "tag": "Pharmacy_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term Pharmacy Faculty Members"
    ],
    "responses": [
        "Here are the Fixed Term Pharmacy Faculty Members: \n Tristan Joseph A. Flores II, RpH \n John Christian Y. Lara, RPh, LPT, MPAf \n Karen Joy S. Maniulit, RPh, PharmD \n Shaira Gayle T. Techon, RPh \n Cyrene Keith O. Villanueva, RPh, PharmD"
    ]
    
},

{
    "tag": "Pharmacy_Lecturer_Faculty_Members",
    "patterns": [
        "Lecturer Pharmacy Faculty Members"
    ],
    "responses": [
        "Here are the Lecturer Pharmacy Faculty Members: \n Vinchelle Lynne M. Chua, RPh, PharmD \n Jarmaine Z. David, RPh, PharmD \n Leeland Anthony Dela L. Luna, RPh, PharmD \n Mark Anthony O. Ellana, RPh, PharmD"
    ]
    
},

{
    "tag": "Psychology_Permanent_Faculty_Members",
    "patterns": [
        "Permanent Psychology Faculty Members"
    ],
    "responses": [
        "Here are the Permanent Psychology Faculty Members: \n Gornez, Gemma Rosemarie M. \n Pacayra, Eva E. RPsy \n Pilao, Sonia Janice L. \n Villanueva, Angelina A. \n Villanueva, Jean Marie I."
    ]
    
},

{
    "tag": "Psychology_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term Psychology Faculty Members"
    ],
    "responses": [
        "I'm sorry. Currently, there are no Fixed Term Psychology Faculty Members."
    ]
    
},

{
    "tag": "Psychology_Lecturer_Faculty_Members",
    "patterns": [
        "Lecturer Psychology Faculty Members"
    ],
    "responses": [
        "I'm sorry. Currently, there are no Lecturer Psychology Faculty Members."
    ]
    
},

{
    "tag": "TM_Permanent_Faculty_Members",
    "patterns": [
        "Permanent TourismFaculty Members"
    ],
    "responses": [
        "Here are the Permanent TM Faculty Members: \n Ms. Justine Mariella T. Abrigo \n Ms. Maria Belynda R. Oanes \n Mr. Alpha Re Omega \n Mr. Junn B. Poloyapoy \n Mrs. Joyant Maria Nina T. Reyes \n Dr. Cecilia C. Uncad"
    ]
    
},

{
    "tag": "Tourism_Fixed_Term_Faculty_Members",
    "patterns": [
        "Fixed Term Tourism Faculty Members"
    ],
    "responses": [
        "I'm sorry. Currently, there are no Fixed Term Tourism Faculty Members."
    ]
    
},

{
    "tag": "TM_Lecturer_Faculty_Members",
    "patterns": [
        "Lecturer Tourism Faculty Members"
    ],
    "responses": [
        "I'm sorry. Currently, there are no Lecturer Tourism Faculty Members."
    ]
    
}
  ]}